Write a query identifying the type of each record in the TRIANGLES table using its three side lengths. Output one of the following statements for each record in the table:

Equilateral: It's a triangle with  sides of equal length.
Isosceles: It's a triangle with  sides of equal length.
Scalene: It's a triangle with  sides of differing lengths.
Not A Triangle: The given values of A, B, and C don't form a triangle

SELECT 
    CASE
        WHEN A + B <= C OR A + C <= B OR B + C <= A THEN 'Not A Triangle'
        WHEN A = B AND B = C THEN 'Equilateral'
        WHEN A = B OR B = C OR A = C THEN 'Isosceles'
        ELSE 'Scalene'
    END AS Triangle_Type
FROM TRIANGLES;

In [ ]:
Samantha was tasked with calculating the average monthly salaries for all employees in the EMPLOYEES table, but did not realize her keyboard's  key was broken until after completing the calculation. She wants your help finding the difference between her miscalculation (using salaries with any zeros removed), and the actual average salary.

Write a query calculating the amount of error (i.e.:  average monthly salaries), and round it up to the next integer.

SELECT CEIL(AVG(SALARY) - AVG(CAST(REPLACE(CAST(SALARY AS CHAR), '0', '') AS UNSIGNED))) 
       AS error_difference
FROM EMPLOYEES;

/*
MEDIAN
*/
SET @rowindex := -1;

SELECT
   ROUND(AVG(d.LAT_N), 4) AS Median
FROM
   (SELECT @rowindex := @rowindex + 1 AS rowindex,
           STATION.LAT_N AS LAT_N
    FROM STATION
    ORDER BY STATION.LAT_N) AS d
WHERE
  d.rowindex IN (FLOOR(@rowindex / 2), CEIL(@rowindex / 2));

# primE

WITH RECURSIVE Numbers AS (
    SELECT 2 AS num
    UNION ALL
    SELECT num + 1 FROM Numbers WHERE num < 1000
)
SELECT GROUP_CONCAT(num SEPARATOR '&') 
FROM Numbers 
WHERE NOT EXISTS (
    SELECT 1 
    FROM Numbers AS n 
    WHERE n.num < Numbers.num 
    AND Numbers.num % n.num = 0
    AND n.num > 1
);

P(R) represents a pattern drawn by Julia in R rows. The following pattern represents P(5):

* * * * * 
* * * * 
* * * 
* * 
*
Write a query to print the pattern P(20).

WITH RECURSIVE pattern AS (
    SELECT 20 AS row_num
    UNION ALL
    SELECT row_num - 1
    FROM pattern
    WHERE row_num > 1
)
SELECT REPEAT('* ', row_num) AS pattern_row
FROM pattern;

P(R) represents a pattern drawn by Julia in R rows. The following pattern represents P(5):

* 
* * 
* * * 
* * * * 
* * * * *
Write a query to print the pattern P(20).

WITH RECURSIVE pattern AS (
    SELECT 1 AS row_num
    UNION ALL
    SELECT row_num + 1
    FROM pattern
    WHERE row_num < 20
)
SELECT REPEAT('* ', row_num) AS pattern_row
FROM pattern;